class Parameters {
  static final rangeMap = {
    '1': '300m',
    '2': '500m',
    '3': '1km',
    '4': '2km',
    '5': '3km',
  };

  static final genreMap = {
    "": "特になし",
    "G001": "居酒屋",
    "G002": "ダイニングバー・バル",
    "G003": "創作料理",
    "G004": "和風",
    "G005": "洋食",
    "G006": "イタリアン・フレンチ",
    "G007": "中華",
    "G008": "焼肉・ホルモン",
    "G012": "韓国料理",
    "G016": "お好み焼き・もんじゃ",
  };

  static final marketPriceMap = {
    "": "特になし",
    "B002": "〜3000円",
    "B008": "〜5000円",
    "B004": "〜7000円",
    "B005": "〜10000円",
  };

  static final couponMap = {
    2: "特になし",
    1: "クーポンを取得する",
    0: "クーポンを取得しない",
  };
}